---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowBarBendingUsing
source: html/5dc793a0-c976-7e7d-3dd5-b968bed2510f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowBarBendingUsing Property

"Dimension Type"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeShowBarBendingUsing { get; }
```